# Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд
# и получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером,
# где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый,
# т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

Num = input('Введите шестизначное число: ')
if int(Num[0]) + int(Num[1]) + int(Num[2]) == int(Num[3]) + int(Num[4]) + int(Num[5]):
    print('Счастливый)')
else:
    print('Несчастливый(')