# Найдите сумму цифр трехзначного числа
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)


number = input('Введите набор трех чисел: ')  # ввод числа в строковом типе
print(int(number[0]) + int(number[1]) + int(number[2]))


# или более сложно, но с разделением int-числа

# number = int(input('Введите трехзначное число: '))
# print((number // 100) + (number // 10 % 10) + (number % 100 % 10))
